In [105]:
import pandas as pd
import numpy as np

In [106]:
from pandas import ExcelWriter
from pandas import ExcelFile

In [107]:
retail=pd.read_excel('Online Retail.xlsx')

In [108]:
retail

       InvoiceNo StockCode  ... CustomerID         Country
0         536365    85123A  ...    17850.0  United Kingdom
1         536365     71053  ...    17850.0  United Kingdom
2         536365    84406B  ...    17850.0  United Kingdom
3         536365    84029G  ...    17850.0  United Kingdom
4         536365    84029E  ...    17850.0  United Kingdom
...          ...       ...  ...        ...             ...
541904    581587     22613  ...    12680.0          France
541905    581587     22899  ...    12680.0          France
541906    581587     23254  ...    12680.0          France
541907    581587     23255  ...    12680.0          France
541908    581587     22138  ...    12680.0          France

[541909 rows x 8 columns]

In [109]:
retail.shape

(541909, 8)

In [110]:
df=[retail["InvoiceDate"],retail["CustomerID"]]
headers=["Date","Customers"]
Rdf=pd.concat(df,axis=1,keys=headers)

In [111]:
Rdf.sort_values(by=["Date"])

                      Date  Customers
0      2010-12-01 08:26:00    17850.0
1      2010-12-01 08:26:00    17850.0
2      2010-12-01 08:26:00    17850.0
3      2010-12-01 08:26:00    17850.0
4      2010-12-01 08:26:00    17850.0
...                    ...        ...
541896 2011-12-09 12:50:00    12680.0
541895 2011-12-09 12:50:00    12680.0
541907 2011-12-09 12:50:00    12680.0
541900 2011-12-09 12:50:00    12680.0
541908 2011-12-09 12:50:00    12680.0

[541909 rows x 2 columns]

In [112]:
Rdf.shape

(541909, 2)

In [113]:
Rdf.groupby('Date').count()

                     Customers
Date
2010-12-01 08:26:00          7
2010-12-01 08:28:00          2
2010-12-01 08:34:00         16
2010-12-01 08:35:00          1
2010-12-01 08:45:00         20
...                        ...
2011-12-09 12:23:00          2
2011-12-09 12:25:00          2
2011-12-09 12:31:00         21
2011-12-09 12:49:00          4
2011-12-09 12:50:00         15

[23260 rows x 1 columns]

In [114]:
Rdf = Rdf.groupby(by='Date', as_index=False).agg({'Customers': pd.Series.nunique})

In [115]:
Rdf

                     Date  Customers
0     2010-12-01 08:26:00        1.0
1     2010-12-01 08:28:00        1.0
2     2010-12-01 08:34:00        1.0
3     2010-12-01 08:35:00        1.0
4     2010-12-01 08:45:00        1.0
...                   ...        ...
23255 2011-12-09 12:23:00        1.0
23256 2011-12-09 12:25:00        1.0
23257 2011-12-09 12:31:00        1.0
23258 2011-12-09 12:49:00        1.0
23259 2011-12-09 12:50:00        1.0

[23260 rows x 2 columns]

In [116]:
new=pd.DataFrame({'Date':[pd.Timestamp('2010-12-01T00')],'Customers':[0]})
Rdf=pd.concat([new,Rdf]).reset_index(drop=True)
Rdf

                     Date  Customers
0     2010-12-01 00:00:00        0.0
1     2010-12-01 08:26:00        1.0
2     2010-12-01 08:28:00        1.0
3     2010-12-01 08:34:00        1.0
4     2010-12-01 08:35:00        1.0
...                   ...        ...
23256 2011-12-09 12:23:00        1.0
23257 2011-12-09 12:25:00        1.0
23258 2011-12-09 12:31:00        1.0
23259 2011-12-09 12:49:00        1.0
23260 2011-12-09 12:50:00        1.0

[23261 rows x 2 columns]

In [117]:
Rdf=Rdf.groupby(pd.Grouper(key='Date',freq='H')).sum()

In [118]:
Rdf

                     Customers
Date
2010-12-01 00:00:00        0.0
2010-12-01 01:00:00        0.0
2010-12-01 02:00:00        0.0
2010-12-01 03:00:00        0.0
2010-12-01 04:00:00        0.0
...                        ...
2011-12-09 08:00:00        4.0
2011-12-09 09:00:00       12.0
2011-12-09 10:00:00        9.0
2011-12-09 11:00:00        8.0
2011-12-09 12:00:00       13.0

[8965 rows x 1 columns]